{
    "CVSSv3": {
        "CVSS": "3.1",
        "E": "P",
        "attackVector": "NETWORK",
        "attackComplexity": "LOW",
        "privilegesRequired": "NONE",
        "userInteraction": "NONE",
        "scope": "UNCHANGED",
        "confidentiality": "NONE",
        "integrity": "NONE",
        "availability": "LOW"
    },
    "credit": [
        "endansdto"
    ],
    "cvssDetails": [],
    "cvssScore": 5.3,
    "disclosureTime": "2023-12-14 02:27:56",
    "epssDetails": null,
    "exploitMaturity": "Proof of Concept",
    "id": "SNYK-JS-AXIOS-6124857",
    "identifiers": {
        "CVE": [],
        "CWE": [
            "CWE-1333"
        ]
    },
    "language": "js",
    "malicious": false,
    "packageManager": "npm",
    "publicationTime": "2023-12-14 09:43:10",
    "remediation": "Upgrade axios to version 1.6.3 or higher. ",
    "severity": "medium",
    "socialTrendAlert": false,
    "title": "Regular Expression Denial of Service (ReDoS)",
    "vulnDescription": {
        "Details": "Denial of Service (DoS) describes a family of attacks, all aimed at making a system inaccessible to its original and legitimate users. There are many types of DoS attacks, ranging from trying to clog the network pipes to the system by generating a large volume of traffic from many machines (a Distributed Denial of Service - DDoS - attack) to sending crafted requests that cause a system to crash or take a disproportional amount of time to process. The Regular expression Denial of Service (ReDoS) is a type of Denial of Service attack. Regular expressions are incredibly powerful, but they aren't very intuitive and can ultimately end up making it easy for attackers to take your site down. Let’s take the following regular expression as an example: regex = /A(B|C+)+D/ This regular expression accomplishes the following: A The string must start with the letter 'A' (B|C+)+ The string must then follow the letter A with either the letter 'B' or some number of occurrences of the letter 'C' (the + matches one or more times). The + at the end of this section states that we can look for one or more matches of this section. D Finally, we ensure this section of the string ends with a 'D' The expression would match inputs such as ABBD , ABCCCCD , ABCBCCCD and ACCCCCD It most cases, it doesn't take very long for a regex engine to find a match: $ time node -e '/A(B|C+)+D/.test(\"ACCCCCCCCCCCCCCCCCCCCCCCCCCCCD\")' 0.04s user 0.01s system 95% cpu 0.052 total $ time node -e '/A(B|C+)+D/.test(\"ACCCCCCCCCCCCCCCCCCCCCCCCCCCCX\")' 1.79s user 0.02s system 99% cpu 1.812 total The entire process of testing it against a 30 characters long string takes around ~52ms. But when given an invalid string, it takes nearly two seconds to complete the test, over ten times as long as it took to test a valid string. The dramatic difference is due to the way regular expressions get evaluated. Most Regex engines will work very similarly (with minor differences). The engine will match the first possible way to accept the current character and proceed to the next one. If it then fails to match the next one, it will backtrack and see if there was another way to digest the previous character. If it goes too far down the rabbit hole only to find out the string doesn’t match in the end, and if many characters have multiple valid regex paths, the number of backtracking steps can become very large, resulting in what is known as catastrophic backtracking . Let's look at how our expression runs into this problem, using a shorter string: \"ACCCX\". While it seems fairly straightforward, there are still four different ways that the engine could match those three C's: CCC CC+C C+CC C+C+C. The engine has to try each of those combinations to see if any of them potentially match against the expression. When you combine that with the other steps the engine must take, we can use RegEx 101 debugger to see the engine has to take a total of 38 steps before it can determine the string doesn't match. From there, the number of steps the engine must use to validate a string just continues to grow. String Number of C's Number of steps ACCCX 3 38 ACCCCX 4 71 ACCCCCX 5 136 ACCCCCCCCCCCCCCX 14 65,553 By the time the string includes 14 C's, the engine has to take over 65,000 steps just to see if the string is valid. These extreme situations can cause them to work very slowly (exponentially related to input size, as shown above), allowing an attacker to exploit this and can cause the service to excessively consume CPU, resulting in a Denial of Service. ",
        "Overview": "axios is a promise-based HTTP client for the browser and Node.js. Affected versions of this package are vulnerable to Regular Expression Denial of Service (ReDoS). An attacker can deplete system resources by providing a manipulated string as input to the format method, causing the regular expression to exhibit a time complexity of O(n^2) . This makes the server to become unable to provide normal service due to the excessive cost and time wasted in processing vulnerable regular expressions. ",
        "PoC": "const axios = require('axios'); console.time('t1'); axios.defaults.baseURL = '/'.repeat(10000) + 'a/'; axios.get('/a').then(()=>{}).catch(()=>{}); console.timeEnd('t1'); console.time('t2'); axios.defaults.baseURL = '/'.repeat(100000) + 'a/'; axios.get('/a').then(()=>{}).catch(()=>{}); console.timeEnd('t2'); /* stdout t1: 60.826ms t2: 5.826s */ "
    },
    "source_code": [
        {
            "filename": "lib/helpers/combineURLs.js",
            "diff": "@@ -10,6 +10,6 @@\n  */\n export default function combineURLs(baseURL, relativeURL) {\n   return relativeURL\n-    ? baseURL.replace(/\\/+$/, '') + '/' + relativeURL.replace(/^\\/+/, '')\n+    ? baseURL.replace(/\\/?\\/$/, '') + '/' + relativeURL.replace(/^\\/+/, '')\n     : baseURL;\n }"
        },
        {
            "filename": "test/specs/defaults.spec.js",
            "diff": "@@ -178,10 +178,25 @@ describe('defaults', function () {\n     const instance = axios.create();\n     axios.defaults.baseURL = 'http://example.org/';\n \n+    instance.get('/foo/users');\n+\n+    getAjaxRequest().then(function (request) {\n+      expect(request.url).toBe('/foo/users');\n+      done();\n+    });\n+  });\n+\n+  it('should resistent to ReDoS attack', function (done) {\n+    const instance = axios.create();\n+    const start = performance.now();\n+    const slashes = '/'.repeat(100000);\n+    instance.defaults.baseURL = '/' + slashes + 'bar/';\n     instance.get('/foo');\n \n     getAjaxRequest().then(function (request) {\n-      expect(request.url).toBe('/foo');\n+      const elapsedTimeMs = performance.now() - start;\n+      expect(elapsedTimeMs).toBeLessThan(20);\n+      expect(request.url).toBe('/' + slashes + 'bar/foo');\n       done();\n     });\n   });"
        }
    ],
    "commitTime": "2023-12-26 20:29:26"
}